In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [6]:
l1 = [4,8,15,16,23,42]
ser = pd.Series(l1)
ser

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
l2 = [1,2.4,'asd',True,22,'pwskills',101,22,33,45]

In [9]:
ser2 = pd.Series(l2)

In [10]:
ser2

0           1
1         2.4
2         asd
3        True
4          22
5    pwskills
6         101
7          22
8          33
9          45
dtype: object

Q3. Create a Pandas DataFrame that contains the following data.Then, print the DataFrame.

In [11]:
data = {'Name':['Alice','Bob','Claire'],
        'Age':[25,30,27],
        'Gender':['Female','Male','Female']}

In [13]:
df = pd.DataFrame(data)

In [14]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

Series can only contain single list with index, whereas dataframe can be made of more than one series or we can say that a dataframe is a collection of series that can be used to analyse the data.

In [15]:
#Example of dataframe
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
#Example of series
ds = df['Name']

In [19]:
ds

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [20]:
type(ds)

pandas.core.series.Series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Some of the manupulation are:-  
Dropping columns in the data.  
Dropping rows in the data.  
Renaming a column in the dataset.   
Select columns with specific data types.  
Slicing the dataset.    

We can use in case of a data is missing like age is not given.

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size immutable.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [22]:
courses = pd.Series(["data science","web development","c++"])
fees = pd.Series([3500,2500,1500])
discount  = pd.Series(['10%','20%','15%'])


df=pd.concat([courses,fees,discount],axis=1)

In [23]:
df

                 0     1    2
0     data science  3500  10%
1  web development  2500  20%
2              c++  1500  15%